In [1]:
import pandas as pd
import numpy as np
import sklearn

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
TrainData = pd.read_csv("./Data/train.csv")
TestData = pd.read_csv("./Data/test.csv")

In [4]:
TrainData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
TrainData.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
print(TrainData.columns.values)

['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']

In [7]:
TrainData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
TrainData[['Survived','PassengerId']].groupby('Survived').count()
TrainData[['Survived','Pclass','PassengerId']].groupby(['Survived','Pclass']).count()
TrainData[['Survived','SibSp','PassengerId']].groupby(['Survived','SibSp']).count()
TrainData[['Survived','SibSp','Parch']].groupby(['Survived','Parch']).count()
TrainData[['Survived','SibSp','Embarked']].groupby(['Survived','Embarked']).count()
TrainData[['Survived','Sex']].groupby(['Sex'],as_index = False).mean()

          PassengerId
Survived
0                 549
1                 342

                 PassengerId
Survived Pclass
0        1                80
         2                97
         3               372
1        1               136
         2                87
         3               119

                PassengerId
Survived SibSp
0        0              398
         1               97
         2               15
         3               12
         4               15
         5                5
         8                7
1        0              210
         1              112
         2               13
         3                4
         4                3

                SibSp
Survived Parch
0        0        445
         1         53
         2         40
         3          2
         4          4
         5          4
         6          1
1        0        233
         1         65
         2         40
         3          3
         5          1

                   SibSp
Survived Embarked
0        C            75
         Q            47
         S           427
1        C            93
         Q            30
         S           217

      Sex  Survived
0  female  0.742038
1    male  0.188908

### Count number of Missing values in features ###
****Only relevant features are considered****

In [9]:
TrainData[['Age']].isnull().sum()
TrainData[['Pclass']].isnull().sum()
TrainData[['Parch']].isnull().sum()
TrainData[['SibSp']].isnull().sum()
TrainData[['Cabin']].isnull().sum()
TrainData[['Ticket']].isnull().sum()
TrainData[['Embarked']].isnull().sum()

Age    177
dtype: int64

Pclass    0
dtype: int64

Parch    0
dtype: int64

SibSp    0
dtype: int64

Cabin    687
dtype: int64

Ticket    0
dtype: int64

Embarked    2
dtype: int64

In [10]:
TrainData[TrainData['Ticket'].duplicated()==False]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Fix missing values

In [11]:
combine = [TrainData,TestData]
combine[0].shape
combine[1].shape

(891, 12)

(418, 11)

In [12]:
TrainData.drop(['Ticket','Cabin'],axis=1,inplace=True)
TestData.drop(['Ticket','Cabin'],axis=1,inplace=True)

In [13]:
TrainData.shape
TestData.shape

(891, 10)

(418, 9)

### Creating new features###

In [14]:
TrainData['Family'] = TrainData.SibSp + TrainData.Parch + 1
TestData['Family'] = TestData.SibSp + TestData.Parch + 1

combine = [TrainData, TestData]

In [15]:
for dataset in combine:
    dataset['Title'] = dataset.Name.str.extract(' ([A-Za-z]+)\.',expand = False)

In [16]:
TrainData.groupby(['Title']).count()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Family
Title,,,,,,,,,,,
Capt,1,1,1,1,1,1,1,1,1,1,1
Col,2,2,2,2,2,2,2,2,2,2,2
Countess,1,1,1,1,1,1,1,1,1,1,1
Don,1,1,1,1,1,1,1,1,1,1,1
Dr,7,7,7,7,7,6,7,7,7,7,7
Jonkheer,1,1,1,1,1,1,1,1,1,1,1
Lady,1,1,1,1,1,1,1,1,1,1,1
Major,2,2,2,2,2,2,2,2,2,2,2
Master,40,40,40,40,40,36,40,40,40,40,40
Miss,182,182,182,182,182,146,182,182,182,181,182
Mlle,2,2,2,2,2,2,2,2,2,2,2
Mme,1,1,1,1,1,1,1,1,1,1,1
Mr,517,517,517,517,517,398,517,517,517,517,517
Mrs,125,125,125,125,125,108,125,125,125,124,125
Ms,1,1,1,1,1,1,1,1,1,1,1
Rev,6,6,6,6,6,6,6,6,6,6,6
Sir,1,1,1,1,1,1,1,1,1,1,1

In [17]:
for dataset in combine:
    dataset['Title'] = dataset.Title.replace(
        ['Capt','Col','Countess','Don','Jonkheer','Lady','Major','Rev','Sir','Dr'],'Rare')
    dataset['Title'] = dataset.Title.replace(['Mlle','Ms'],'Miss')
    dataset['Title'] = dataset.Title.replace('Mme','Mrs')
    
TrainData[['Title','Survived']].groupby('Title',as_index=False).mean()

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826

In [18]:
title_mapping = {'Mr':1,'Miss':2,'Mrs':3,'Master':4,'Rare':5}

for dataset in combine:
    dataset['Title'] = dataset.Title.map(title_mapping)
    dataset['Title'] = dataset.Title.fillna(0)
    
TrainData[['Title','Survived']].groupby('Title',as_index=False).mean()

   Title  Survived
0      1  0.156673
1      2  0.702703
2      3  0.793651
3      4  0.575000
4      5  0.347826

In [19]:
TrainData.drop(['Name','PassengerId'],axis=1,inplace = True)
TestData.drop(['Name'],axis=1,inplace = True)

combine = [TrainData,TestData]
TrainData.shape
TestData.shape

(891, 10)

(418, 10)

### Convert  categorical values to numerical

In [20]:
for dataset in combine:
    dataset['Sex'] = dataset.Sex.map({'male':0,'female':1}).astype(int)

In [21]:
TrainData.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Family  Title
0         0       3    0  22.0      1      0   7.2500        S       2      1
1         1       1    1  38.0      1      0  71.2833        C       2      3
2         1       3    1  26.0      0      0   7.9250        S       1      2
3         1       1    1  35.0      1      0  53.1000        S       2      3
4         0       3    0  35.0      0      0   8.0500        S       1      1

### Completing a numerical feature

In [22]:
guess_ages = np.zeros((2,3))
guess_ages

array([[0., 0., 0.],
       [0., 0., 0.]])

In [23]:
for dataset in combine:
    for i in range(0,2):
        for j in range(0,3):
            guess_df = dataset[(dataset.Sex == i) & (dataset.Pclass == j+1)]['Age'].dropna()
            guess_ages[i,j] = round(guess_df.median()*2)/2

In [24]:
guess_ages

array([[42., 28., 24.],
       [41., 24., 22.]])

In [25]:
for dataset in combine:
    for i in range(0,2):
        for j in range(0,3):
            dataset.loc[(dataset.Age.isnull()) & (dataset.Sex == i) & (dataset.Pclass == j+1),'Age'] = guess_ages[i,j]
            
    dataset['Age'] = dataset['Age'].astype(int)

In [26]:
TrainData['AgeBand'] = pd.cut(TrainData['Age'],5)
TrainData[['AgeBand','Survived']].groupby('AgeBand',as_index=False).mean()

         AgeBand  Survived
0  (-0.08, 16.0]  0.550000
1   (16.0, 32.0]  0.337374
2   (32.0, 48.0]  0.412037
3   (48.0, 64.0]  0.434783
4   (64.0, 80.0]  0.090909

In [27]:
for dataset in combine:
    dataset.loc[dataset.Age <= 16,'Age'] = 0
    dataset.loc[(dataset.Age <= 32) & (dataset.Age > 16),'Age'] = 1
    dataset.loc[(dataset.Age <= 48) & (dataset.Age > 32),'Age'] = 2
    dataset.loc[(dataset.Age <= 64) & (dataset.Age > 48),'Age'] = 3
    dataset.loc[ dataset.Age > 64,'Age'] = 4

In [28]:
TrainData.drop('AgeBand',axis=1,inplace = True)
combine = [TrainData,TestData]
TrainData.shape
TestData.shape

(891, 10)

(418, 10)

In [29]:
TrainData.head()

   Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked  Family  Title
0         0       3    0    1      1      0   7.2500        S       2      1
1         1       1    1    2      1      0  71.2833        C       2      3
2         1       3    1    1      0      0   7.9250        S       1      2
3         1       1    1    2      1      0  53.1000        S       2      3
4         0       3    0    2      0      0   8.0500        S       1      1

In [30]:
TrainData[['Family','Survived']].groupby('Family', as_index= False).mean()

   Family  Survived
0       1  0.303538
1       2  0.552795
2       3  0.578431
3       4  0.724138
4       5  0.200000
5       6  0.136364
6       7  0.333333
7       8  0.000000
8      11  0.000000

### Completing Categorical variables

In [31]:
freq_port = TrainData.Embarked.mode()[0]

In [32]:
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].fillna(freq_port)
    
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].map({"S":0,"C":1,"Q":2}).astype(int)

In [33]:
TrainData.head()

   Survived  Pclass  Sex  Age  SibSp  Parch     Fare  Embarked  Family  Title
0         0       3    0    1      1      0   7.2500         0       2      1
1         1       1    1    2      1      0  71.2833         1       2      3
2         1       3    1    1      0      0   7.9250         0       1      2
3         1       1    1    2      1      0  53.1000         0       2      3
4         0       3    0    2      0      0   8.0500         0       1      1

In [34]:
TrainData[['Embarked','Survived']].groupby('Embarked', as_index= False).mean()

   Embarked  Survived
0         0  0.339009
1         1  0.553571
2         2  0.389610

In [35]:
TestData.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           1
Embarked       0
Family         0
Title          0
dtype: int64

### Fix missing value in Test Data

In [36]:
TestData.Fare.fillna(TestData['Fare'].dropna().median(),inplace=True)

In [37]:
TrainData['FareBand'] = pd.qcut(TrainData.Fare,4)
TrainData[['FareBand','Survived']].groupby('FareBand',as_index=False).mean()

          FareBand  Survived
0   (-0.001, 7.91]  0.197309
1   (7.91, 14.454]  0.303571
2   (14.454, 31.0]  0.454955
3  (31.0, 512.329]  0.581081

In [38]:
for dataset in combine:
    dataset.loc[dataset.Fare <= 7.91,'Fare'] = 0
    dataset.loc[(dataset.Fare <= 14.45) & (dataset.Fare > 7.91),'Fare'] = 1
    dataset.loc[(dataset.Fare <= 31.00) & (dataset.Fare > 14.45),'Fare'] = 2
    dataset.loc[(dataset.Fare > 31.00),'Fare'] = 3
    dataset['Fare'] = dataset['Fare'].astype(int)
    
TrainData.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Family,Title,FareBand
0,0,3,0,1,1,0,0,0,2,1,"(-0.001, 7.91]"
1,1,1,1,2,1,0,3,1,2,3,"(31.0, 512.329]"
2,1,3,1,1,0,0,1,0,1,2,"(7.91, 14.454]"
3,1,1,1,2,1,0,3,0,2,3,"(31.0, 512.329]"
4,0,3,0,2,0,0,1,0,1,1,"(7.91, 14.454]"

In [39]:
TrainData.drop('FareBand',axis=1,inplace=True)

In [40]:
combine = [TrainData,TestData]
TrainData.shape
TestData.shape
TrainData.head()

(891, 10)

(418, 10)

   Survived  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked  Family  Title
0         0       3    0    1      1      0     0         0       2      1
1         1       1    1    2      1      0     3         1       2      3
2         1       3    1    1      0      0     1         0       1      2
3         1       1    1    2      1      0     3         0       2      3
4         0       3    0    2      0      0     1         0       1      1

## Model Building

### Divide Training set into Train and Validation set

In [41]:
from sklearn.model_selection import train_test_split

In [42]:
train_df, val_df = train_test_split(TrainData,test_size = 0.15,random_state = 42)

In [43]:
train_df.shape
val_df.shape

(757, 10)

(134, 10)

In [44]:
X_train = train_df.drop('Survived',axis=1)
Y_train = train_df['Survived']

X_val = val_df.drop('Survived',axis=1)
Y_val = val_df['Survived']

In [45]:
X_train.shape
Y_train.shape

X_val.shape
Y_val.shape

(757, 9)

(757,)

(134, 9)

(134,)

### Logistic Regression

In [46]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [47]:
logreg = LogisticRegression()

In [48]:
logreg.fit(X_train,Y_train)
Y_pred = logreg.predict(X_val)

/opt/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

#### Training Accuracy

In [49]:
logreg.score(X_train,Y_train)

0.8137384412153237

In [50]:
coeff_df = pd.DataFrame(X_train.columns)
coeff_df.columns = ['Features']
coeff_df['LogReg Coefficient'] = pd.Series(logreg.coef_[0])
coeff_df.sort_values(by=['LogReg Coefficient'],ascending=False)

   Features  LogReg Coefficient
1       Sex            2.147196
8     Title            0.530584
5      Fare            0.282349
6  Embarked            0.201998
7    Family           -0.119021
4     Parch           -0.126818
3     SibSp           -0.374253
2       Age           -0.563217
0    Pclass           -0.871225

#### Validation accuracy

In [51]:
accuracy_score(Y_val,Y_pred)

0.7985074626865671

## Support Vector Classifier

In [52]:
from sklearn.svm import SVC

In [53]:
svm = SVC()

In [54]:
svm.fit(X_train,Y_train)
Y_pred_svm = svm.predict(X_val)

/opt/anaconda3/lib/python3.7/site-packages/sklearn/svm/base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='auto_deprecated',
    kernel='rbf', max_iter=-1, probability=False, random_state=None,
    shrinking=True, tol=0.001, verbose=False)

In [55]:
svm.score(X_train,Y_train)

0.8401585204755614

In [56]:
accuracy_score(Y_val,Y_pred_svm)

0.835820895522388

## Decision Tree

In [57]:
from sklearn.tree import DecisionTreeClassifier

In [58]:
dtree = DecisionTreeClassifier()

In [59]:
dtree.fit(X_train,Y_train)
dtree.score(X_train,Y_train)
Y_pred_dtree = dtree.predict(X_val)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

0.8916776750330251

In [60]:
accuracy_score(Y_val,Y_pred_dtree)

0.8283582089552238

## Random Forest Classifier

In [61]:
from sklearn.ensemble import RandomForestClassifier

In [62]:
rf = RandomForestClassifier(n_estimators=100,random_state=42)

In [63]:
rf.fit(X_train,Y_train)
rf.score(X_train,Y_train)
Y_pred_rf = rf.predict(X_val)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=42, verbose=0,
                       warm_start=False)

0.8916776750330251

In [64]:
accuracy_score(Y_val,Y_pred_rf)

0.8283582089552238

## AdaBoost Classifier

In [65]:
from sklearn.ensemble import AdaBoostClassifier

In [66]:
ada = AdaBoostClassifier(n_estimators=100,random_state=42)

In [67]:
ada.fit(X_train,Y_train)
ada.score(X_train,Y_train)
Y_pred_ada = ada.predict(X_val)

AdaBoostClassifier(algorithm='SAMME.R', base_estimator=None, learning_rate=1.0,
                   n_estimators=100, random_state=42)

0.8269484808454426

In [68]:
accuracy_score(Y_val,Y_pred_ada)

0.8283582089552238

## Naive Bayes Classifier

In [69]:
from sklearn.naive_bayes import GaussianNB

In [70]:
nb = GaussianNB()

In [71]:
nb.fit(X_train,Y_train)
nb.score(X_train,Y_train)
Y_pred_nb = nb.predict(X_val)

GaussianNB(priors=None, var_smoothing=1e-09)

0.7833553500660502

In [72]:
accuracy_score(Y_val,Y_pred_nb)

0.7611940298507462

# Predict on Test set using the best models
#### SVM, RandomForest and Decision Tree have the highest training and Validation accuracy

In [73]:
X_test = TestData.drop('PassengerId',axis=1)

In [74]:
test_results_svm = svm.predict(X_test)
test_results_rf = rf.predict(X_test)
test_results_dtree = dtree.predict(X_test)

In [75]:
Submission_svm = pd.DataFrame({'PassengerId':TestData['PassengerId'],'Survived':test_results_svm})
Submission_dtree = pd.DataFrame({'PassengerId':TestData['PassengerId'],'Survived':test_results_dtree})
Submission_rf = pd.DataFrame({'PassengerId':TestData['PassengerId'],'Survived':test_results_rf})

In [79]:
Submission_svm.to_csv("./Submission_svm.csv",index=False)
Submission_dtree.to_csv("./Submission_dtree.csv",index=False)
Submission_rf.to_csv("./Submission_rf.csv",index=False)